[
{
    "id" : 1,
    "spLevel" : 1,
    "spMagicSchool" : 1,
    "spName" : "Armor of Agathys",
    "castTime" : "1 action",
    "spComponent" : "S",
    "range" : "Self",
    "spDuration" : "1 hour",
    "spDescription" : "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.",
    "damageType" : "COLD damage",
    "spScaling" : "When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot"
},
{
    "id" : 2,
    "spLevel" : 2,
    "spMagicSchool" : 1,
    "spName" : "Lesser restoration",
    "castTime" : "1 action",
    "range" : "Touch",
    "spComponent" : "V, S",
    "spDuration" : "Instantaneous",
    "spDescription" : "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used."
},
{
    "id" : 3,
    "spLevel" : 3,
    "spMagicSchool" : 1,
    "spName" : "Counterspell",
    "castTime" : "1 reaction, which you take when you see a creature within 60 feet of you casting a spell",
    "spComponent" : "S",
    "range" : "60 feet",
    "spDuration" : "Instantaneous",
    "spDescription" : "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used."
},
{
    "id" : 4,
    "spLevel" : 1,
    "spMagicSchool" : 2,
    "spName" : "Arms of Hadar",
    "castTime" : "1 action",
    "range" : "Self (10-foot radius)",
    "spComponent" : "V, S",
    "spDuration" : "Instantaneous",
    "spDescription" : "You invoke the power of Hadar, the Dark Hunger. Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can’t take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect.",
    "damageType" : "2d6 Necrotic",
    "spScaling" : "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st"
},
{
    "id" : 5,
    "spLevel" : 2,
    "spMagicSchool" : 2,
    "spName" : "Cloud of Daggers",
    "castTime" : "1 action",
    "range" : "60 feet",
    "spComponent" : "V, S, M (a sliver of glass)",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell’s area for the first time on a turn or starts its turn there.",
    "damageType" : "4d4 Slashing",
    "spScaling" : "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd."
},
{
    "id" : 6,
    "spLevel" : 3,
    "spMagicSchool" : 2,
    "spName" : "Conjure Lesser Demon",
    "castTime" : "1 action",
    "range" : "60 feet",
    "spComponent" : "V, S, M (a vial of blood from an intelligent humanoid killed within the past 24 hours)",
    "spDuration" : "Concentration, up to 1 hour",
    "spDescription" : "You summon up to a total of eight manes or dretches that appear in unoccupied spaces you can see within range. A manes or dretch disappears when it drops to 0 hit points or when the spell ends. The demons are hostile to all creatures. Roll initiative for the summoned demons as a group, which has its own turns. The demons attack the nearest non-demons to the best of their ability. As part of casting the spell, you can scribe a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. The summoned demons cannot cross the circle or target anyone in it while the spell lasts. Using the material component in this manner consumes it.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 6th or 7th level, you summon sixteen demons. If you cast it using a spell slot of 8th or 9th level, you summon thirty-two demons"
},
{
    "id" : 7,
    "spLevel" : 1,
    "spMagicSchool" : 3,
    "spName" : "Comprehend Languages",
    "castTime" : "1 action",
    "range" : "Self",
    "spComponent" : "V, S, M (a pinch of soot and salt)",
    "spDuration" : "1 hour",
    "damageType" : "None",
    "spDescription" : "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.This spell doesn’t decode secret messages in a text or glyph, such as an arcane sigil, that isn’t part of a written language.",
    "spScaling" : "None"
},
{
    "id" : 8,
    "spLevel" : 2,
    "spMagicSchool" : 3,
    "spName" : "Detect Thoughts",
    "castTime" : "1 action",
    "range" : "Self",
    "spComponent" : "V, S, M (a copper piece)",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected. You initially learn the surface thoughts of the creature—what is most on its mind in that moment. As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning.",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 9,
    "spLevel" : 3,
    "spMagicSchool" : 3,
    "spName" : "Clairvoyance",
    "castTime" : "10 minutes",
    "range" : "1 mile",
    "spComponent" : "V, S, M (a focus worth at least 100 gp, either a jeweled horn for hearing or a glass eye for seeing)",
    "spDuration" : "Concentration, up to 10 minutes",
    "spDescription" : "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can’t be attacked or otherwise interacted with.When you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing. A creature that can see the sensor (such as a creature benefitting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist.",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 10,
    "spLevel" : 1,
    "spMagicSchool" : 4,
    "spName" : "Bane",
    "castTime" : "1 action",
    "range" : "30 feet",
    "spComponent" : "V, S, M (a drop of blood)",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
},
{
    "id" : 11,
    "spLevel" : 2,
    "spMagicSchool" : 4,
    "spName" : "Hold Person",
    "castTime" : "1 Action",
    "range" : "60 feet",
    "spComponent" : "V, S, M (a small, straight piece of iron)",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them."
},
{
    "id" : 12,
    "spLevel" : 3,
    "spMagicSchool" : 4,
    "spName" : "Motivational Speech",
    "castTime" : "1 minutes",
    "range" : "60 feet",
    "spComponent" : "V",
    "spDuration" : "1 hour",
    "spDescription" : "Choose up to five creatures within range that can hear you. For the duration, each affected creature gains 5 temporary hit points and has advantage on Wisdom saving throws. If an affected creature is hit by an attack, it has advantage on the next attack roll it makes. Once an affected creature loses the temporary hit points granted by this spell, the spell ends for that creature.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 4th level or higher, the temporary hit points increase by 5 for each slot level above 3rd."
},
{
    "id" : 13,
    "spLevel" : 1,
    "spMagicSchool" : 5,
    "spName" : "Burning Hands",
    "castTime" : "1 action",
    "range" : "Self (15-foot cone)",
    "spComponent" : "V, S",
    "spDuration" : "Instantaneous",
    "spDescription" : "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.The fire ignites any flammable objects in the area that aren’t being worn or carried.",
    "damageType" : "3d6 fire",
    "spScaling" : "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
},
{
    "id" : 14,
    "spLevel" : 2,
    "spMagicSchool" : 5,
    "spName" : "Darkness",
    "castTime" : "1 action",
    "range" : "60 feet",
    "spComponent" : "V, M (bat fur and a drop of pitch or piece of coal)",
    "spDuration" : "Concentration, up to 10 minutes",
    "spDescription" : "Magical darkness spreads from a point you choose within range to fill a 15-foot radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can’t see through this darkness, and nonmagical light can’t illuminate it. If the point you choose is on an object you are holding or one that isn’t being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.",
    "damageType" : "None",
    "spScaling" : "If any of this spell’s area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled."
},
{
    "id" : 15,
    "spLevel" : 3,
    "spMagicSchool" : 5,
    "spName" : "Fireball",
    "castTime" : "1 action",
    "range" : "150 feet",
    "spComponent" : "V, S, M (a tiny ball of bat guano and sulfur)",
    "spDuration" : "Instantaneous",
    "spDescription" : "A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot radius must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried.",
    "damageType" : "8d6 fire",
    "spScaling" : "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd."
},
{
    "id" : 16,
    "spLevel" : 1,
    "spMagicSchool" : 6,
    "spName" : "Disguise Self",
    "castTime" : "1 action",
    "range" : "Self",
    "spComponent" : "V, S",
    "spDuration" : "1 hour",
    "spDescription" : "You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The changes wrought by this spell fail to hold up to physical inspection",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 17,
    "spLevel" : 2,
    "spMagicSchool" : 6,
    "spName" : "Phantasmal Force",
    "castTime" : "1 action",
    "range" : "60 feet",
    "spComponent" : "V, S, M (a bit of fleece)",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an Intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs. The phantasm includes sound, temperature, and other stimuli, also evident only to the creature. The target can use its action to examine the phantasm with an Intelligence (Investigation) check against your spell save DC. If the check succeeds, the target realizes that the phantasm is an illusion, and the spell ends. While a target is affected by the spell, the target treats the phantasm as if it were real. The target rationalizes any illogical outcomes from interacting with the phantasm. Each round on your turn, the phantasm can deal 1d6 psychic damage to the target if it is in the phantasm’s area or within 5 feet of the phantasm, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking",
    "damageType" : "1d6 psychic",
    "spScaling" : "None"
},
{
    "id" : 18,
    "spLevel" : 3,
    "spMagicSchool" : 6,
    "spName" : "Phantom Steed",
    "castTime" : "1 action",
    "range" : "30 feet",
    "spComponent" : "V, S",
    "spDuration" : "1 hour",
    "spDescription" : "A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature’s appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed. For the duration, you or a creature you choose can ride the steed. The creature uses the statistics for a riding horse, except it has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. When the spell ends, the steed gradually fades, giving the rider 1 minute to dismount. The spell ends if you use an action to dismiss it or if the steed takes any damage.",
    "damageType" : "None",
    "spScaling" : "None "
},
{
    "id" : 19,
    "spLevel" : 1,
    "spMagicSchool" : 7,
    "spName" : "Inflict Wounds",
    "castTime" : "1 action",
    "range" : "Touch",
    "spComponent" : "V, S",
    "spDuration" : "Instantaneous",
    "spDescription" : "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage.",
    "damageType" : "3d10 necrotic",
    "spScaling" : "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st."
},
{
    "id" : 20,
    "spLevel" : 2,
    "spMagicSchool" : 7,
    "spName" : "Ray of Enfeeblement",
    "castTime" : "1 action",
    "range" : "60 feet",
    "spComponent" : "V, S",
    "spDuration" : "Concentration, up to 1 minute",
    "spDescription" : "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends. At the end of each of the target’s turns, it can make a Constitution saving throw against the spell. On a success, the spell ends.",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 21,
    "spLevel" : 3,
    "spMagicSchool" : 7,
    "spName" : "Animate Dead",
    "castTime" : "1 minute",
    "range" : "10 feet",
    "spComponent" : "V, S, M (a drop of blood, a piece of flesh, and a pinch of bone dust)",
    "spDuration" : "hour",
    "spDescription" : "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature’s game statistics). On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you. The creature is under your control for 24 hours, after which it stops obeying any command you’ve given it. To maintain the control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.",
    "damageType" : "None",
    "spScaling" : "When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
},
{
    "id" : 22,
    "spLevel" : 1,
    "spMagicSchool" : 8,
    "spName" : "Feather Fall",
    "castTime" : "1 reaction, which you take when you or a creature within 60 feet of you falls",
    "range" : "60 feet",
    "spComponent" : "V, M (a small feather or piece of down)",
    "spDuration" : "1 minute",
    "spDescription" : "Choose up to five falling creatures within range. A falling creature’s rate of descent slows to 60 feet per round until the spell ends. If the creature lands before the spell ends, it takes no falling damage and can land on its feet, and the spell ends for that creature.",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 23,
    "spLevel" : 2,
    "spMagicSchool" : 8,
    "spName" : "Darkvision",
    "castTime" : "1 action",
    "range" : "Touch",
    "spComponent" : "V, S, M (either a pinch of dried carrot or an agate)",
    "spDuration" : "8 hours",
    "spDescription" : "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.",
    "damageType" : "None",
    "spScaling" : "None"
},
{
    "id" : 24,
    "spLevel" : 3,
    "spMagicSchool" : 8,
    "spName" : "Blink",
    "castTime" : "1 action",
    "range" : "Self",
    "spComponent" : "V, S",
    "spDuration" : "1 minute",
    "spDescription" : "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of you next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more that one space is equally near). You can dismiss this spell as an action. While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can’t see anything more than 60 feet away.You can only affect and be affected by other creatures on the Ethereal Plane. Creature that aren’t there can’t perceive you or interact with you, unless they have the ability to do so. ",
    "damageType" : "None",
    "spScaling" : "None"
}
]